# Taps
tap "git-friendly/git-friendly"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"

# CLI tools
brew "python@3.11" # Required by awscli
brew "awscli" # Official Amazon AWS command-line interface
brew "bat" # Output highlighting (better `cat`)
brew "eza" # Listing files with info (better `ls`)
brew "fd" # Find entries in your filesystem (better `find`)
brew "fnm" # Node.js version manager
brew "fzf" # Fuzzy file finder and filtering
brew "gh" # GitHub CLI: interact with GitHub PRs, issues, repos
brew "git" # Version control
brew "git-delta" # Diff pager for `git` and `grep` output (better `diff`)
brew "htop" # Performance and resource monitoring tool (better `top`)
brew "neovim" # Text editor for terminal
brew "node" # Fallback Node.js version
brew "pnpm" # Efficient Node.js package manager
brew "ripgrep" # Searching within files (better `grep`)
brew "starship" # Prompt manager
brew "zoxide" # Convenient and magical navigation (better `cd`)
brew "zellij" # Terminal multiplexer
brew "direnv" # Load/unload environment variables based on $PWD
brew "wget" # Internet file retriever
brew "rustup-init" # Rust toolchain installer
brew "zsh-autosuggestions" # Fish-like autosuggestions for Zsh
brew "zsh-syntax-highlighting" # Fish-like syntax highlighting for Zsh
brew "jesseduffield/lazydocker/lazydocker" # Full Docker management app
brew "jesseduffield/lazygit/lazygit" # Full Git management app
brew "nmap" # Port scanning utility for large networks
brew "yazi" # Blazing fast terminal file manager written in Rust, based on async I/O
brew "jq" # Lightweight and flexible command-line JSON processor
brew "luarocks" # Package manager for the Lua programming language
brew "ast-grep" # Code searching, linting, rewriting

# GUI apps
cask "nikitabobko/tap/aerospace" # AeroSpace is an i3-like tiling window manager for macOS
cask "ollama" # Get up and running with large language models locally
cask "docker" # Running containerized applications
cask "wezterm" # Better terminal emulator
cask "slack" # Messaging social platform
cask "discord" # Messaging social platform
cask "spotify" # Audio streaming platform
cask "google-chrome" # Chrome browser
cask "telegram" # Messenger

# Fonts
cask "font-meslo-lg-nerd-font" # MesloLG Nerd Font
